<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <link rel="stylesheet" href="assets/style.css?t=90051322">
    <script src="assets/script.js?t=93f1a66c"></script>
    <title>需求分析 - metro</title>
    <meta name="viewport" content="width=device-width">
  </head>
  <body class="-menu-visible">
    <div class="doc-layout">
      <div class="toggle menu-toggle js-menu-toggle"></div>
      <div class="menu toc-menu">
        <ul>
          <li class="menu-item -level-0 -parent">
            <ul class="submenu">
              <li class="menu-item -level-1"><a class="link title  link-index" href="index.html">metro</a>
              </li>
              <li class="menu-item -level-1"><a class="link title -active link-undefined" href="需求分析.html">需求分析</a>
                <ul class="headings heading-list">
                  <li class="heading-item -depth-2"><a class="hlink link-" href="#">一 引言</a>
                    <ul class="heading-list -depth-2">
                      <li class="heading-item -depth-3"><a class="hlink link-1.1" href="#1.1">1.1 编写目的</a>
                      </li>
                      <li class="heading-item -depth-3"><a class="hlink link-1.2" href="#1.2">1.2 项目范围</a>
                      </li>
                      <li class="heading-item -depth-3"><a class="hlink link-1.3" href="#1.3">1.3 定义、缩略语、缩写</a>
                      </li>
                    </ul>
                  </li>
                  <li class="heading-item -depth-2"><a class="hlink link-." href="#.">二. 系统需求概述</a>
                    <ul class="heading-list -depth-2">
                      <li class="heading-item -depth-3"><a class="hlink link-2.2" href="#2.2">2.2 假设和依赖</a>
                      </li>
                    </ul>
                  </li>
                  <li class="heading-item -depth-2"><a class="hlink link-." href="#.">三. 系统详细需求</a>
                    <ul class="heading-list -depth-2">
                      <li class="heading-item -depth-3"><a class="hlink link-3.1" href="#3.1">3.1 功能需求</a>
                      </li>
                      <li class="heading-item -depth-3"><a class="hlink link-3.2" href="#3.2">3.2 可用性</a>
                      </li>
                      <li class="heading-item -depth-3"><a class="hlink link-3.3" href="#3.3">3.3 可靠性</a>
                      </li>
                      <li class="heading-item -depth-3"><a class="hlink link-3.4" href="#3.4">3.4 性能</a>
                      </li>
                      <li class="heading-item -depth-3"><a class="hlink link-3.5" href="#3.5">3.5 硬件要求</a>
                      </li>
                    </ul>
                  </li>
                </ul>
              </li>
            </ul>
          </li>
        </ul>
      </div>
      <div class="body page-undefined">
        <div class="header-nav">
          <div class="right">
          </div>
        </div>
        <div class="markdown-body"><h1 id>&#x6B66;&#x6C49;&#x5730;&#x94C1;&#x6A21;&#x62DF;&#x8FD0;&#x884C;&#x7CFB;&#x7EDF;&#x9700;&#x6C42;&#x8BF4;&#x660E;&#x4E66;</h1>
<h2 id>&#x4E00; &#x5F15;&#x8A00;</h2>
<h3 id="1.1">1.1 &#x7F16;&#x5199;&#x76EE;&#x7684;</h3>
<p>&#x5730;&#x4E0B;&#x94C1;&#x9053;&#xFF0C;&#x7B80;&#x79F0;&#x5730;&#x94C1;&#xFF0C;&#x4EA6;&#x7B80;&#x79F0;&#x4E3A;&#x5730;&#x4E0B;&#x94C1;&#xFF0C;&#x72ED;&#x4E49;&#x4E0A;&#x4E13;&#x6307;&#x5728;&#x5730;&#x4E0B;&#x8FD0;&#x884C;&#x4E3A;&#x4E3B;&#x7684;&#x57CE;&#x5E02;&#x94C1;&#x8DEF;&#x7CFB;&#x7EDF;&#x6216;&#x6377;&#x8FD0;&#x7CFB;&#x7EDF;&#xFF1B;&#x4F46;&#x5E7F;&#x4E49;&#x4E0A;&#xFF0C;&#x7531;&#x4E8E;&#x8BB8;&#x591A;&#x6B64;&#x7C7B;&#x7684;&#x7CFB;&#x7EDF;&#x4E3A;&#x4E86;&#x914D;&#x5408;&#x4FEE;&#x7B51;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x53EF;&#x80FD;&#x4E5F;&#x4F1A;&#x6709;&#x5730;&#x9762;&#x5316;&#x7684;&#x8DEF;&#x6BB5;&#x5B58;&#x5728;&#xFF0C;&#x56E0;&#x6B64;&#x901A;&#x5E38;&#x6DB5;&#x76D6;&#x4E86;&#x90FD;&#x4F1A;&#x5730;&#x533A;&#x5404;&#x79CD;&#x5730;&#x4E0B;&#x4E0E;&#x5730;&#x9762;&#x4E0A;&#x7684;&#x9AD8;&#x5BC6;&#x5EA6;&#x4EA4;&#x901A;&#x8FD0;&#x8F93;&#x7CFB;&#x7EDF;&#x3002; &#x7EDD;&#x5927;&#x591A;&#x6570;&#x7684;&#x57CE;&#x5E02;&#x8F68;&#x9053;&#x4EA4;&#x901A;&#x7CFB;&#x7EDF;&#x90FD;&#x662F;&#x7528;&#x6765;&#x8FD0;&#x8F7D;&#x5E02;&#x5185;&#x901A;&#x52E4;&#x7684;&#x4E58;&#x5BA2;&#xFF0C;&#x800C;&#x5728;&#x5F88;&#x591A;&#x573A;&#x5408;&#x4E0B;&#x57CE;&#x5E02;&#x8F68;&#x9053;&#x4EA4;&#x901A;&#x7CFB;&#x7EDF;&#x90FD;&#x4F1A;&#x88AB;&#x5F53;&#x6210;&#x57CE;&#x5E02;&#x4EA4;&#x901A;&#x7684;&#x9AA8;&#x5E72;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x57CE;&#x5E02;&#x8F68;&#x9053;&#x4EA4;&#x901A;&#x7CFB;&#x7EDF;&#x662F;&#x8BB8;&#x591A;&#x90FD;&#x5E02;&#x7528;&#x4EE5;&#x89E3;&#x51B3;&#x4EA4;&#x901A;&#x5835;&#x585E;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x968F;&#x7740;&#x4E2D;&#x56FD;&#x57CE;&#x5E02;&#x7684;&#x8FC5;&#x901F;&#x53D1;&#x5C55;&#xFF0C;&#x5730;&#x94C1;&#x627F;&#x62C5;&#x7740;&#x8D8A;&#x6765;&#x8D8A;&#x91CD;&#x8981;&#x7684;&#x4EFB;&#x52A1; &#x2014;&#x2014;&#x7F13;&#x89E3;&#x57CE;&#x5E02;&#x4EA4;&#x901A;&#x538B;&#x529B; &#x3002;</p>
<p>&#x300A;&#x6B66;&#x6C49;&#x5730;&#x94C1;&#x6A21;&#x62DF;&#x8FD0;&#x884C;&#x7CFB;&#x7EDF;&#x9700;&#x6C42;&#x8BF4;&#x660E;&#x4E66;&#x300B;&#x7684;&#x76EE;&#x7684;&#x662F;&#x660E;&#x786E;&#x300A;&#x6B66;&#x6C49;&#x5730;&#x94C1;&#x6A21;&#x62DF;&#x8FD0;&#x884C;&#x7CFB;&#x7EDF;&#x300B;&#x4E2D;&#x5404;&#x9879;&#x529F;&#x80FD;&#x548C;&#x975E;&#x529F;&#x80FD;&#x9700;&#x6C42;&#xFF0C;&#x786E;&#x5B9A;&#x7CFB;&#x7EDF;&#x529F;&#x80FD;&#x6A21;&#x5757;&#xFF0C;&#x540C;&#x65F6;&#x4E3A;&#x6982;&#x8981;&#x8BBE;&#x8BA1;&#x548C;&#x8BE6;&#x7EC6;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x63D0;&#x4F9B;&#x8BBE;&#x8BA1;&#x4F9D;&#x636E;&#xFF0C;&#x4E5F;&#x53EF;&#x4F9B;&#x672C;&#x9879;&#x76EE;&#x7684;&#x5176;&#x4ED6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53C2;&#x9605;&#x3002;&#x672C;&#x9700;&#x6C42;&#x5206;&#x6790;&#x62A5;&#x544A;&#x7684;&#x76EE;&#x7684;&#x662F;&#x89C4;&#x8303;&#x5316;&#x672C;&#x8F6F;&#x4EF6;&#x7684;&#x7F16;&#x5199;&#xFF0C;&#x65E8;&#x5728;&#x4E8E;&#x63D0;&#x9AD8;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x80FD;&#x89C1;&#x5EA6;&#xFF0C;&#x4FBF;&#x4E8E;&#x5BF9;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x63A7;&#x5236;&#x4E0E;&#x7BA1;&#x7406;&#xFF0C;&#x540C;&#x65F6;&#x63D0;&#x51FA;&#x4E86;&#x672C;&#x5730;&#x94C1;&#x552E;&#x7968;&#x7CFB;&#x7EDF;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#xFF0C;&#x4FBF;&#x4E8E;&#x7A0B;&#x5E8F;&#x5458;&#x4E0E;&#x5BA2;&#x6237;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x6D41;&#x3001;&#x534F;&#x4F5C;&#xFF0C;&#x5E76;&#x4F5C;&#x4E3A;&#x5DE5;&#x4F5C;&#x6210;&#x679C;&#x7684;&#x539F;&#x59CB;&#x4F9D;&#x636E;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x8868;&#x660E;&#x4E86;&#x672C;&#x8F6F;&#x4EF6;&#x7684;&#x5171;&#x6027;&#xFF0C;&#x4EE5;&#x671F;&#x80FD;&#x591F;&#x83B7;&#x5F97;&#x66F4;&#x5927;&#x8303;&#x56F4;&#x7684;&#x5E94;&#x7528;&#x3002;</p>
<p>&#x672C;&#x6587;&#x6863;&#x9700;&#x8981;&#x4EA4;&#x4E8E;&#x8BBA;&#x8BC1;&#x4EBA;&#x5458;&#x8FDB;&#x884C;&#x8BBA;&#x8BC1;&#x4FEE;&#x6539;&#xFF0C;&#x65E0;&#x8BEF;&#x540E;&#x4F9B;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x8FDB;&#x884C;&#x540E;&#x671F;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;  &#x3002;</p>
<h3 id="1.2">1.2 &#x9879;&#x76EE;&#x8303;&#x56F4;</h3>
<p>&#x672C;&#x6B21;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x5730;&#x94C1;&#x8FD0;&#x884C;&#x6A21;&#x62DF;&#x7CFB;&#x7EDF;&#x3002;&#x901A;&#x8FC7;&#x7BA1;&#x7406;&#x5458;&#x3001;&#x4E58;&#x5BA2;&#x7684;&#x6B63;&#x786E;&#x64CD;&#x4F5C;&#x548C;&#x7CFB;&#x7EDF;&#x7684;&#x914D;&#x5408;&#x901A;&#x8FC7;&#x4E92;&#x8054;&#x7F51;&#x8FDB;&#x884C;&#x552E;&#x7968;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x901A;&#x8FC7;&#x6B64;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#x5730;&#x94C1;&#x8C03;&#x5EA6;&#x670D;&#x52A1;&#x3002;&#x7CFB;&#x7EDF;&#x7684;&#x529F;&#x80FD;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x4E58;&#x5BA2;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x5730;&#x56FE;&#x83B7;&#x5F97;&#x6B66;&#x6C49;&#x5730;&#x94C1;&#x7EBF;&#x8DEF;&#x7684;&#x8FD0;&#x884C;&#x4FE1;&#x606F;&#x3002;</li>
<li>&#x4E58;&#x5BA2;&#x80FD;&#x591F;&#x9009;&#x62E9;&#x7EC8;&#x70B9;&#xFF0C;&#x5E76;&#x83B7;&#x5F97;&#x7968;&#x4EF7;&#x4FE1;&#x606F;&#x548C;&#x9884;&#x8BA1;&#x65F6;&#x95F4;&#x3002;</li>
<li>&#x4E58;&#x5BA2;&#x80FD;&#x591F;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x95F4;&#x8FD4;&#x56DE;&#x4E0A;&#x4E00;&#x6B65;&#x64CD;&#x4F5C;&#x6216;&#x9000;&#x51FA;&#x7CFB;&#x7EDF;&#x3002;</li>
<li>&#x4E58;&#x5BA2;&#x80FD;&#x591F;&#x8D2D;&#x4E70;&#x6B66;&#x6C49;&#x901A;&#x5730;&#x94C1;&#x5361;&#x548C;&#x5145;&#x503C;&#x6B66;&#x6C49;&#x901A;&#x3002;</li>
<li>&#x7BA1;&#x7406;&#x5458;&#x80FD;&#x591F;&#x5728;&#x8F93;&#x5165;&#x5408;&#x6CD5;&#x7684;&#x7528;&#x6237;&#x8D26;&#x53F7;&#x548C;&#x5BC6;&#x7801;&#x540E;&#xFF0C;&#x767B;&#x5F55;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E76;&#x8BBE;&#x7F6E;&#x552E;&#x7968;&#x7CFB;&#x7EDF;&#x7684;&#x8D77;&#x70B9;&#x3002;</li>
<li>&#x7BA1;&#x7406;&#x5458;&#x80FD;&#x591F;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x95F4;&#x8FD4;&#x56DE;&#x4E0A;&#x4E00;&#x6B65;&#x64CD;&#x4F5C;&#x6216;&#x9000;&#x51FA;&#x7CFB;&#x7EDF;&#x3002;</li>
<li>&#x7BA1;&#x7406;&#x5458;&#x80FD;&#x591F;&#x7EF4;&#x62A4;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#xFF0C;&#x5305;&#x62EC;&#x5217;&#x8F66;&#x3001;&#x8BA2;&#x5355;&#x7B49;&#x6570;&#x636E;&#x7684;&#x65B0;&#x589E;&#xFF0C;&#x66F4;&#x65B0;&#xFF0C;&#x5220;&#x9664;&#x548C;&#x68C0;&#x7D22;&#x3002;</li>
<li>&#x7BA1;&#x7406;&#x5458;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5217;&#x8F66;&#x7684;&#x4EBA;&#x6D41;&#x591A;&#x5C11;&#x7B49;&#x968F;&#x65F6;&#x8C03;&#x6574;&#x5217;&#x8F66;&#x7684;&#x8F66;&#x6B21;&#xFF0C;&#x4F7F;&#x5217;&#x8F66;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x7684;&#x6295;&#x5165;&#x4F7F;&#x7528;&#xFF0C;&#x5B9E;&#x73B0;&#x8D44;&#x6E90;&#x7684;&#x5408;&#x7406;&#x5229;&#x7528;&#x3002;</li>
<li>&#x7BA1;&#x7406;&#x5458;&#x9488;&#x5BF9;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x60C5;&#x51B5;&#xFF0C;&#x53EF;&#x4EE5;&#x5173;&#x95ED;&#x5730;&#x94C1;&#x7AD9;&#x6216;&#x5730;&#x94C1;&#x7EBF;&#x8DEF;&#x3002;</li>
</ul>
<h3 id="1.3">1.3 &#x5B9A;&#x4E49;&#x3001;&#x7F29;&#x7565;&#x8BED;&#x3001;&#x7F29;&#x5199;</h3>
<ul>
<li>&#x4E58;&#x5BA2;&#xFF1A; &#x901A;&#x8FC7;&#x4E92;&#x8054;&#x7F51;&#x4F7F;&#x7528;&#x8BE5;&#x7CFB;&#x7EDF;&#x6765;&#x8D2D;&#x4E70;&#x8F66;&#x7968;&#x7684;&#x4EBA;&#x3002;</li>
<li>&#x7BA1;&#x7406;&#x5458;&#xFF1A; &#x7BA1;&#x7406;&#x6B64;&#x8D2D;&#x7968;&#x7CFB;&#x7EDF;&#x7684;&#x4EBA;&#x3002;</li>
<li>&#x7528;&#x6237;&#xFF1A; &#x4E58;&#x5BA2;&#x548C;&#x7BA1;&#x7406;&#x5458;&#x3001;&#x552E;&#x7968;&#x7BA1;&#x7406;&#x5458;&#x3002;</li>
<li>&#x7CFB;&#x7EDF;&#xFF1A; &#x5730;&#x94C1;&#x552E;&#x7968;&#x7CFB;&#x7EDF;</li>
</ul>
<h2 id=".">&#x4E8C;. &#x7CFB;&#x7EDF;&#x9700;&#x6C42;&#x6982;&#x8FF0;</h2>
<p>&#x7CFB;&#x7EDF;&#x7528;&#x4F8B;&#x7BA1;&#x7406;&#x56FE;&#xFF0C;&#x552E;&#x7968;&#x7528;&#x4F8B;&#x56FE;</p>
<p>[&#x5047;&#x88C5;&#x8FD9;&#x91CC;&#x6709;&#x56FE;]</p>
<p>&#x7528;&#x4F8B;&#x7684;&#x6982;&#x8981;&#x63CF;&#x8FF0;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<table>
<thead>
<tr>
<th style="text-align:left">&#x4E3B;&#x8981;&#x53C2;&#x4E0E;&#x8005;</th>
<th style="text-align:left">&#x4F18;&#x5148;&#x7EA7;</th>
<th style="text-align:left">&#x7528;&#x4F8B;&#x540D;</th>
<th style="text-align:left">&#x7528;&#x4F8B;&#x6982;&#x8FF0;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:left">&#x4E58;&#x5BA2;</td>
<td style="text-align:left">&#x9AD8;</td>
<td style="text-align:left">&#x4E58;&#x5BA2;&#x8D2D;&#x7968;</td>
<td style="text-align:left">&#x4E58;&#x5BA2;&#x53EF;&#x901A;&#x8FC7;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x8D2D;&#x7968;&#x3002;</td>
</tr>
<tr>
<td style="text-align:left">&#x4E58;&#x5BA2;</td>
<td style="text-align:left">&#x9AD8;</td>
<td style="text-align:left">&#x4E58;&#x5BA2;&#x8FDB;&#x884C;&#x7EBF;&#x8DEF;&#x67E5;&#x8BE2;</td>
<td style="text-align:left">&#x4E58;&#x5BA2;&#x53EF;&#x901A;&#x8FC7;&#x754C;&#x9762;&#x4E0A;&#x7684;&#x5730;&#x56FE;&#x8FDB;&#x884C;&#x8DEF;&#x7EBF;&#x67E5;&#x8BE2;</td>
</tr>
<tr>
<td style="text-align:left">&#x4E58;&#x5BA2;</td>
<td style="text-align:left">&#x9AD8;</td>
<td style="text-align:left">&#x4E58;&#x5BA2;&#x8FDB;&#x884C;&#x7968;&#x4EF7;&#x548C;&#x65F6;&#x95F4;&#x67E5;&#x8BE2;</td>
<td style="text-align:left">&#x4E58;&#x5BA2;&#x53EF;&#x8F93;&#x5165;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x7968;&#x4EF7;&#x548C;&#x65F6;&#x95F4;&#x67E5;&#x8BE2;&#x3002;</td>
</tr>
<tr>
<td style="text-align:left">&#x4E58;&#x5BA2;</td>
<td style="text-align:left">&#x9AD8;</td>
<td style="text-align:left">&#x4E58;&#x5BA2;&#x8D2D;&#x4E70;&#x548C;&#x5145;&#x503C;&#x6B66;&#x6C49;&#x901A;</td>
<td style="text-align:left">&#x4E58;&#x5BA2;&#x9009;&#x62E9;&#x6B66;&#x6C49;&#x901A;&#x5361;&#x5E76;&#x8D2D;&#x4E70;&#xFF0C;&#x6216;&#x63D2;&#x5165;&#x6B66;&#x6C49;&#x901A;&#x5E76;&#x5145;&#x503C;</td>
</tr>
<tr>
<td style="text-align:left">&#x7BA1;&#x7406;&#x5458;</td>
<td style="text-align:left">&#x4E2D;</td>
<td style="text-align:left">&#x7BA1;&#x7406;&#x5458;&#x767B;&#x5F55;&#x7CFB;&#x7EDF;</td>
<td style="text-align:left">&#x7BA1;&#x7406;&#x5458;&#x80FD;&#x591F;&#x767B;&#x5F55;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x548C;&#x552E;&#x7968;&#x7CFB;&#x7EDF;&#x3002;</td>
</tr>
<tr>
<td style="text-align:left">&#x7BA1;&#x7406;&#x5458;</td>
<td style="text-align:left">&#x4E2D;</td>
<td style="text-align:left">&#x7BA1;&#x7406;&#x5458;&#x7BA1;&#x7406;&#x5217;&#x8F66;&#x4FE1;&#x606F;</td>
<td style="text-align:left">&#x7BA1;&#x7406;&#x5458;&#x80FD;&#x591F;&#x589E;&#x52A0;&#x3001;&#x5220;&#x9664;&#x548C;&#x4FEE;&#x6539;&#x5217;&#x8F66;&#x7684;&#x4FE1;&#x606F;&#x3002;</td>
</tr>
<tr>
<td style="text-align:left">&#x7BA1;&#x7406;&#x5458;</td>
<td style="text-align:left">&#x4E2D;</td>
<td style="text-align:left">&#x7BA1;&#x7406;&#x5458;&#x7BA1;&#x7406;&#x7EBF;&#x8DEF;&#x4FE1;&#x606F;</td>
<td style="text-align:left">&#x7BA1;&#x7406;&#x5458;&#x80FD;&#x591F;&#x589E;&#x52A0;&#x3001;&#x5220;&#x9664;&#x5730;&#x94C1;&#x7EBF;&#x8DEF;&#x7684;&#x4FE1;&#x606F; &#x3002;</td>
</tr>
<tr>
<td style="text-align:left">&#x7BA1;&#x7406;&#x5458;</td>
<td style="text-align:left">&#x4F4E;</td>
<td style="text-align:left">&#x7BA1;&#x7406;&#x5458;&#x7EF4;&#x62A4;&#x6570;&#x636E;</td>
<td style="text-align:left">&#x7BA1;&#x7406;&#x5458;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x7684;&#x7EF4;&#x62A4;&#x3002;</td>
</tr>
<tr>
<td style="text-align:left">&#x7BA1;&#x7406;&#x5458;</td>
<td style="text-align:left">&#x9AD8;</td>
<td style="text-align:left">&#x7BA1;&#x7406;&#x5458;&#x7BA1;&#x7406;&#x5217;&#x8F66;&#x8C03;&#x5EA6;</td>
<td style="text-align:left">&#x7BA1;&#x7406;&#x5458;&#x53EF;&#x4EE5;&#x7BA1;&#x7406;&#x5730;&#x94C1;&#x5217;&#x8F66;&#x7684;&#x8C03;&#x5EA6;&#x3002;</td>
</tr>
</tbody>
</table>
<h3 id="2.2">2.2 &#x5047;&#x8BBE;&#x548C;&#x4F9D;&#x8D56;</h3>
<p>&#x4E58;&#x5BA2;&#x5FC5;&#x987B;&#x5177;&#x5907;&#x57FA;&#x672C;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x77E5;&#x8BC6;&#x3002;</p>
<p>&#x7BA1;&#x7406;&#x5458;&#x3001;&#x552E;&#x7968;&#x7BA1;&#x7406;&#x5458;&#x5FC5;&#x987B;&#x7ECF;&#x8FC7;&#x4E00;&#x5B9A;&#x7684;&#x57F9;&#x8BAD;&#x3002;&#x5426;&#x5219;&#x5C06;&#x5F71;&#x54CD;&#x7CFB;&#x7EDF;&#x7684;&#x4F7F;&#x7528;&#x6548;&#x679C;</p>
<h2 id=".">&#x4E09;. &#x7CFB;&#x7EDF;&#x8BE6;&#x7EC6;&#x9700;&#x6C42;</h2>
<h3 id="3.1">3.1 &#x529F;&#x80FD;&#x9700;&#x6C42;</h3>
<p>&#x672C;&#x8282;&#x63CF;&#x8FF0;&#x4E86;&#x7528;&#x4F8B;&#x4E2D;&#x901A;&#x7528;&#x7684;&#x529F;&#x80FD;&#x6027;&#x9700;&#x6C42;&#x3002;</p>
<p><strong>&#x25B6;  &#x65E5;&#x5FD7;&#x7CFB;&#x7EDF;</strong></p>
<p>&#x6240;&#x6709;&#x7684;&#x7CFB;&#x7EDF;&#x51FA;&#x9519;&#x4FE1;&#x606F;&#x90FD;&#x5FC5;&#x987B;&#x88AB;&#x8BB0;&#x5F55;&#x5230;&#x51FA;&#x9519;&#x65E5;&#x5FD7;&#x4E2D;&#x3002;&#x4FE1;&#x606F;&#x7684;&#x683C;&#x5F0F;&#x5FC5;&#x987B;&#x662F;&#x7CFB;&#x7EDF;&#x9519;&#x8BEF;&#x53F7;&#x7801;&#x3001;&#x65E5;&#x671F;&#x3001;&#x65F6;&#x95F4;&#x3001;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x548C;&#x7528;&#x6237;&#x76F8;&#x5173;&#x7684;&#x6BCF;&#x4E2A;&#x9875;&#x9762;&#x8FC1;&#x79FB;&#x4FE1;&#x606F;&#x90FD;&#x5FC5;&#x987B;&#x88AB;&#x8BB0;&#x5F55;&#x5230;&#x8FFD;&#x5BFB;&#x65E5;&#x5FD7;&#x4E2D;&#x3002;&#x4FE1;&#x606F;&#x7684;&#x683C;&#x5F0F;&#x5FC5;&#x987B;&#x662F;&#x7528;&#x6237;&#x5E10;&#x53F7;&#x3001;&#x65E5;&#x671F;&#x3001;&#x65F6;&#x95F4;&#x3001;&#x8FC1;&#x79FB;&#x7684;&#x9875;&#x9762;&#x540D;&#x3002;</p>
<p>&#x6BCF;&#x6B21;&#x5904;&#x7406;&#x524D;&#x540E;&#x7684;&#x6D88;&#x8017;&#x7684;&#x5185;&#x5B58;&#x548C;&#x5904;&#x7406;&#x65F6;&#x95F4;&#x90FD;&#x5FC5;&#x987B;&#x88AB;&#x8BB0;&#x5F55;&#x5230;&#x6027;&#x80FD;&#x65E5;&#x5FD7;&#x4E2D;&#x3002;&#x4FE1;&#x606F;&#x7684;&#x683C;&#x5F0F;&#x5FC5;&#x987B;&#x662F;&#x65E5;&#x671F;&#x3001;&#x65F6;&#x95F4;&#x3001;&#x6D88;&#x8017;&#x7684;&#x5185;&#x5B58;&#x3001;&#x5904;&#x7406;&#x65F6;&#x95F4;&#x3002;</p>
<p><strong>&#x25B6;  &#x90AE;&#x4EF6;&#x7CFB;&#x7EDF;</strong></p>
<p>&#x7CFB;&#x7EDF;&#x6240;&#x6709;&#x7684;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x9884;&#x5148;&#x8BBE;&#x5B9A;&#x7684;&#x90AE;&#x4EF6;&#x7CFB;&#x7EDF;&#x53D1;&#x9001;&#x3002;</p>
<p><strong>&#x25B6;  &#x76D1;&#x89C6;&#x7CFB;&#x7EDF;</strong></p>
<p>&#x76D1;&#x89C6;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x626B;&#x63CF;&#x65E5;&#x5FD7;&#x7CFB;&#x7EDF;&#x5982;&#x679C;&#x6709;&#x4EFB;&#x4F55;&#x5F02;&#x5E38;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x90AE;&#x4EF6;&#x7CFB;&#x7EDF;&#x5411;&#x7BA1;&#x7406;&#x5458;&#x53D1;&#x8B66;&#x544A;&#x4FE1;&#x3002;</p>
<p><strong>&#x25B6;  &#x5B89;&#x5168;&#x7CFB;&#x7EDF;</strong></p>
<p>&#x5B89;&#x5168;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x62E6;&#x622A;&#x975E;&#x6CD5;&#x7684;&#x8BBF;&#x95EE;&#xFF0C;&#x548C;&#x5BF9;&#x7F51;&#x7AD9;&#x7684;&#x6076;&#x610F;&#x8FDB;&#x653B;&#x5305;&#x62EC;&#xFF08; XSS &#x3001; SQL Injection &#x3001;&#x975E;&#x6CD5;&#x76D7;&#x94FE;&#x7B49;&#x3001;&#x975E;&#x6CD5;&#x5B57;&#x7B26;&#x8F93;&#x5165;&#x7B49;&#xFF09;&#x3002;</p>
<p><strong>&#x25B6;  &#x4ED8;&#x6B3E;&#x65B9;&#x5F0F;</strong></p>
<p>&#x7CFB;&#x7EDF;&#x76EE;&#x524D;&#x5B9A;&#x4E49;&#x7684;&#x4ED8;&#x6B3E;&#x65B9;&#x5F0F;&#x4E3A; 2 &#x4E2A;&#xFF1A;&#x76F4;&#x63A5;&#x4ED8;&#x6B3E;&#x548C;&#x626B;&#x7801;&#x4ED8;&#x6B3E;&#x3002;</p>
<h3 id="3.2">3.2 &#x53EF;&#x7528;&#x6027;</h3>
<p>&#x4E0B;&#x9762;&#x5217;&#x51FA;&#x4E86;&#x548C;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x7528;&#x6027;&#x76F8;&#x5173;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
<p><strong>&#x25B6;  &#x7CFB;&#x7EDF;&#x5BA2;&#x6237;&#x7AEF;</strong></p>
<p>&#x7CFB;&#x7EDF;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x5FC5;&#x987B;&#x662F; Web &#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x989D;&#x5916;&#x7684;&#x8F6F;&#x4EF6;&#x3002;</p>
<p><strong>&#x25B6;  &#x7CFB;&#x7EDF;&#x6613;&#x7528;&#x6027;</strong></p>
<p>&#x5730;&#x94C1;&#x552E;&#x7968;&#x7CFB;&#x7EDF;&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#x8BBE;&#x8BA1;&#x5FC5;&#x987B;&#x7B80;&#x5355;&#x660E;&#x4E86;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x4E58;&#x5BA2;&#x82B1;&#x8D39;&#x989D;&#x5916;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x5B66;&#x4E60;&#x3002;</p>
<p><strong>&#x25B6;  &#x5E2E;&#x52A9;&#x670D;&#x52A1;</strong></p>
<p>&#x5730;&#x94C1;&#x552E;&#x7968;&#x7CFB;&#x7EDF;&#x7684;&#x6BCF;&#x4E2A;&#x91CD;&#x8981;&#x9875;&#x9762;&#x4E0A;&#x5FC5;&#x987B;&#x90FD;&#x6709;&#x76F8;&#x5173;&#x7684;&#x5E2E;&#x52A9;&#x9875;&#x9762;&#x7684;&#x94FE;&#x63A5;&#xFF0C;&#x4E58;&#x5BA2;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x6765;&#x83B7;&#x5F97;&#x5FC5;&#x8981;&#x7684;&#x5E2E;&#x52A9;&#x4FE1;&#x606F;&#x3002;</p>
<h3 id="3.3">3.3 &#x53EF;&#x9760;&#x6027;</h3>
<p><strong>&#x25B6;  &#x53EF;&#x7528;&#x6027;</strong></p>
<p>&#x5730;&#x94C1;&#x552E;&#x7968;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x80FD;&#x591F; 24 &#x5C0F;&#x65F6; *7 &#x5929;&#x7684;&#x5DE5;&#x4F5C;</p>
<p><strong>&#x25B6;  &#x7CFB;&#x7EDF;&#x53D1;&#x751F;&#x4E25;&#x91CD;&#x9519;&#x8BEF;&#x7684;&#x5E73;&#x5747;&#x65F6;&#x95F4;&#x95F4;&#x9694;</strong></p>
<p>&#x7CFB;&#x7EDF;&#x53D1;&#x751F;&#x4E25;&#x91CD;&#x9519;&#x8BEF;&#x7684;&#x5E73;&#x5747;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x5E94;&#x8BE5;&#x5927;&#x4E8E; 3000 &#x5C0F;&#x65F6;&#x3002;</p>
<h3 id="3.4">3.4 &#x6027;&#x80FD;</h3>
<p><strong>&#x25B6;  &#x6700;&#x5927;&#x7684;&#x5E76;&#x53D1;&#x4EBA;&#x6570;</strong></p>
<p>&#x5730;&#x94C1;&#x552E;&#x7968;&#x7CFB;&#x7EDF;&#x7684;&#x6700;&#x5927;&#x5E76;&#x53D1;&#x8BBF;&#x95EE;&#x6570;&#x5E94;&#x8BE5;&#x4E3A; 1000 &#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x7CFB;&#x7EDF;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x5F88;&#x597D;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<p><strong>&#x25B6;  &#x6700;&#x5927;&#x7CFB;&#x7EDF;&#x54CD;&#x5E94;&#x65F6;&#x95F4;</strong></p>
<p>&#x5728;&#x6700;&#x5927;&#x5E76;&#x53D1;&#x6570;&#x4E3A; 1000 &#x8303;&#x56F4;&#x5185;&#x65F6;&#xFF0C;&#x7CFB;&#x7EDF;&#x5BF9;&#x7528;&#x6237;&#x7684;&#x6700;&#x5927;&#x76F8;&#x5E94;&#x65F6;&#x95F4;&#x5E94;&#x8BE5;&#x5C0F;&#x4E8E; 10 &#x79D2; /1 &#x4E07;&#x6761;&#x6570;&#x636E;&#x3002;</p>
<p><strong>&#x25B6;  &#x6700;&#x5927;&#x7684;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x65F6;&#x95F4;</strong></p>
<p>&#x5730;&#x94C1;&#x552E;&#x7968;&#x7CFB;&#x7EDF;&#x7684;&#x7528;&#x6237;&#x4E8B;&#x52A1;&#x7684;&#x6700;&#x5927;&#x5904;&#x7406;&#x65F6;&#x95F4;&#x5E94;&#x8BE5;&#x662F; 30 &#x79D2;&#xFF0C;&#x5982;&#x679C;&#x8D85;&#x8FC7;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x7CFB;&#x7EDF;&#x5E94;&#x8BE5;&#x81EA;&#x52A8;&#x7ED3;&#x675F;&#x7528;&#x6237;&#x7684;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x3002;</p>
<h3 id="3.5">3.5 &#x786C;&#x4EF6;&#x8981;&#x6C42;</h3>
<p><strong>&#x25B6;  &#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x8F6F;&#x4EF6;</strong></p>
<p>&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x4F7F;&#x7528; Java &#x63A5;&#x53E3;&#x540C;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x8F6F;&#x4EF6;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x3002;</p>
<p><strong>&#x25B6;  Web &#x670D;&#x52A1;&#x5668;&#x8F6F;&#x4EF6;</strong></p>
<p>&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x652F;&#x6301; J2EE &#x89C4;&#x8303;&#x7684; Web &#x670D;&#x52A1;&#x5668;&#x8F6F;&#x4EF6;&#x3002;</p>
<p><strong>&#x25B6;  &#x5E73;&#x53F0;&#x8981;&#x6C42;</strong></p>
<p>&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x5728; CPU &#x4E3A; P3 &#x4EE5;&#x4E0A;&#xFF0C;&#x5185;&#x5B58;&#x4E3A; 512MB &#x4EE5;&#x4E0A;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E3A;&#x5FAE;&#x8F6F; win2000 &#x4EE5;&#x4E0A;&#x6216; Linux(Unix) &#x7684;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x987A;&#x5229;&#x8FD0;&#x884C;&#x3002;</p>
<p><strong>&#x25B6;   Web &#x6D4F;&#x89C8;&#x5668;</strong></p>
<p>&#x7CFB;&#x7EDF;&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#x5FC5;&#x987B;&#x5728; IE 8.0 &#x4EE5;&#x4E0A;&#x6216; Opera12 &#x4EE5;&#x4E0A;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x6B63;&#x5E38;&#x663E;&#x793A;&#x3002;</p>
<p><strong>&#x25B6;  Java &#x7684;&#x7248;&#x672C;</strong></p>
<p>&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x5728; Java1.3 &#x4EE5;&#x4E0A;&#x7684;&#x7248;&#x672C;&#x4E0A;&#x8FD0;&#x884C;&#x3002;</p>

        </div>
        <div class="footer-nav">
          <div class="left"><a href="index.html"><span class="title">metro</span></a></div>
        </div>
      </div>
    </div>
  </body>
</html>